[
  {
    "dates": "Feb 2022 · Present",
    "role": "Software Engineer",
    "company": "Betalectic",
    "description": "• Developed real-time microservices for a B2B finance platform, focusing on secure payment processing with scalable RESTful APIs in NodeJS and AWS database migration. \n • Built and integrated a Forex risk management module with real-time UI updates in React.js and efficient local storage using MongoDB. \n • Created a time-series data pipeline with AWS Timestream to track real-time metrics, improving retrieval speeds by 20% for low-latency data access. \n • Designed secure RESTful financial APIs for cross-functional teams, handling over 5K daily requests with reliable external system integration.",
    "logo": "/assets/images/experiences/btc.ico"
  },
  {
    "dates": "January 2019 · May 2022",
    "role": "Software Engineer",
    "company": "Spectrum Lab",
    "description": "• Designed distributed backend architectures for scalable, high-availability data systems, reducing processing time by 40%. \n • Developed Python and C++ algorithms to optimize data pipelines, enhancing speed and memory efficiency. \n • Architected Apache Kafka data pipelines, boosting data throughput by 25% and reducing processing time by 30%. \n • Deployed solutions on AWS EC2 to improve service reliability and response times by 15%, enhancing data insights. \n • Built secure, high-reliability RESTful APIs with Flask, handling 10,000+ daily requests with 99% uptime. \n • Optimized API performance with Redis caching, reducing response times by 30% on high-traffic endpoints. \n • Containerized services with Docker, achieving streamlined deployments and efficient monitoring with AWS ECS.",
    "logo": "/assets/images/experiences/IISc.ico"
  },
  {
    "dates": "June 2017 · August 2017 ",
    "role": "Software Engineer Intern",
    "company": "Schemax Tech",
    "description": "• Developed and optimized an Android application for real estate management, integrating RESTful APIs for improved data communication. \n • Enhanced application performance, achieving a 25% increase in processing speed and a 20% reduction in memory usage through effective \n JSON parsing optimizations.",
    "logo": "/assets/images/experiences/schemax.ico"
  }
]
